In [24]:
import pandas as pd
from datetime import datetime
import os
import sqlalchemy

In [4]:
df = pd.read_csv('ALL DATA.csv')
print(df.columns)
df.head()

Index(['Year', 'Srvy', 'Survey', 'Survey Id', 'Cruise', 'Haul', 'Stratum',
       'Station', 'Vessel Name', 'Vessel Id', 'Date Time', 'Latitude Dd',
       'Longitude Dd', 'Species Code', 'Common Name', 'Scientific Name',
       'Taxon Confidence', 'Cpue Kgha', 'Cpue Kgkm2', 'Cpue Kg1000km2',
       'Cpue Noha', 'Cpue Nokm2', 'Cpue No1000km2', 'Weight Kg', 'Count',
       'Bottom Temperature C', 'Surface Temperature C', 'Depth M',
       'Distance Fished Km', 'Net Width M', 'Net Height M', 'Area Swept Ha',
       'Duration Hr'],
      dtype='object')

,Year,Srvy,Survey,Survey Id,Cruise,Haul,Stratum,Station,Vessel Name,Vessel Id,...,Weight Kg,Count,Bottom Temperature C,Surface Temperature C,Depth M,Distance Fished Km,Net Width M,Net Height M,Area Swept Ha,Duration Hr
0,2000,AI,Aleutian Islands Bottom Trawl Survey,52,200001,5,721,326-78,Dominator,23,...,31.828,14.0,4.0,5.6,96,1.590,15.560,7.359,2.474040,0.29
1,2000,AI,Aleutian Islands Bottom Trawl Survey,52,200001,5,721,326-78,Dominator,23,...,280.600,50.0,4.0,5.6,96,1.590,15.560,7.359,2.474040,0.29
2,2000,AI,Aleutian Islands Bottom Trawl Survey,52,200001,5,721,326-78,Dominator,23,...,5.900,7.0,4.0,5.6,96,1.590,15.560,7.359,2.474040,0.29
3,2000,AI,Aleutian Islands Bottom Trawl Survey,52,200001,6,721,323-74,Dominator,23,...,10.400,9.0,4.3,4.7,80,1.707,15.503,7.389,2.646362,0.31
4,2000,AI,Aleutian Islands Bottom Trawl Survey,52,200001,6,721,323-74,Dominator,23,...,50.000,50.0,4.3,4.7,80,1.707,15.503,7.389,2.646362,0.31

## Build the Dimension Tables

### Time

In [5]:
def normalize_date_time(date_time_col):
    rows = []
    for date_time in date_time_col:
        if '/' in date_time:
            pythonic = datetime.strptime(date_time, '%m/%d/%Y %H:%M:%S')
        else:
            date_time = '.'.join(date_time.split('-')[:-1] + ['20' + date_time.split('-')[-1]])
        rows.append({
            'Day': pythonic.day,
            'Month': pythonic.month,
            'Year': pythonic.year,
        })
    return pd.DataFrame(rows)

time_cols = normalize_date_time(df['Date Time'])
date_dimension = time_cols.drop_duplicates(['Day', 'Month', 'Year']).reset_index(drop=True).reset_index().rename({'index': 'Key Date'}, axis=1)
date_keys = time_cols.merge(date_dimension, on=['Day', 'Month', 'Year'])['Key Date']
date_dimension.head()

   Key Date  Day  Month  Year
0         0   20      5  2000
1         1   21      5  2000
2         2   22      5  2000
3         3   23      5  2000
4         4   24      5  2000

### Species

In [6]:
species_cols = df[['Species Code', 'Common Name', 'Scientific Name']]
species_dimension = species_cols.drop_duplicates(['Species Code', 'Common Name', 'Scientific Name']).reset_index(drop=True).reset_index().rename({'index': 'Key Species'}, axis=1)
species_keys = species_cols.merge(species_dimension, on=['Species Code', 'Common Name', 'Scientific Name'])['Key Species']
species_dimension.head()

   Key Species  Species Code      Common Name          Scientific Name
0            0         10120  Pacific Halibut  Hippoglossus stenolepis
1            1         21720      Pacific Cod      Gadus macrocephalus
2            2         21740  Walleye Pollock      Gadus chalcogrammus
3            3         10210   Yellowfin Sole           Limanda aspera

### Survey

In [7]:
survey_cols = df[['Survey']]
survey_dimension = survey_cols.drop_duplicates(['Survey']).reset_index(drop=True).reset_index().rename({'index': 'Key Survey'}, axis=1)
survey_keys = survey_cols.merge(survey_dimension, on=['Survey'])['Key Survey']
survey_dimension.head()

   Key Survey                                             Survey
0           0               Aleutian Islands Bottom Trawl Survey
1           1  Eastern Bering Sea Crab/Groundfish Bottom Traw...
2           2                 Gulf of Alaska Bottom Trawl Survey
3           3       Eastern Bering Sea Slope Bottom Trawl Survey
4           4  Northern Bering Sea Crab/Groundfish Survey - E...

### Vessel

In [8]:
vessel_cols = df[['Vessel Id', 'Vessel Name']]
vessel_dimension = vessel_cols.drop_duplicates(['Vessel Id', 'Vessel Name']).reset_index(drop=True).reset_index().rename({'index': 'Key Vessel'}, axis=1)
vessel_keys = vessel_cols.merge(vessel_dimension, on=['Vessel Id', 'Vessel Name'])['Key Vessel']
vessel_dimension.head()

   Key Vessel  Vessel Id    Vessel Name
0           0         23      Dominator
1           1         94    Vesteraalen
2           2         89      Aldebaran
3           3         88       Arcturus
4           4         19  Pat San Marie

## Build the Fact Table

In [9]:
print(df.columns)

Index(['Year', 'Srvy', 'Survey', 'Survey Id', 'Cruise', 'Haul', 'Stratum',
       'Station', 'Vessel Name', 'Vessel Id', 'Date Time', 'Latitude Dd',
       'Longitude Dd', 'Species Code', 'Common Name', 'Scientific Name',
       'Taxon Confidence', 'Cpue Kgha', 'Cpue Kgkm2', 'Cpue Kg1000km2',
       'Cpue Noha', 'Cpue Nokm2', 'Cpue No1000km2', 'Weight Kg', 'Count',
       'Bottom Temperature C', 'Surface Temperature C', 'Depth M',
       'Distance Fished Km', 'Net Width M', 'Net Height M', 'Area Swept Ha',
       'Duration Hr'],
      dtype='object')

In [10]:
fact_cols = df[['Longitude Dd', 'Latitude Dd', 'Depth M', 'Net Width M', 'Net Height M', 'Area Swept Ha', 'Distance Fished Km', 'Weight Kg', 'Count', 'Bottom Temperature C', 'Surface Temperature C']]
fact_cols = fact_cols.rename({'Longitude Dd': 'Longitude', 'Latitude Dd': 'Latitude'}, axis=1)
fact_cols['Key Date'] = date_keys
fact_cols['Key Species'] = species_keys
fact_cols['Key Survey'] = survey_keys
fact_cols['Key Vessel'] = vessel_keys
fact_cols.head()

,Longitude,Latitude,Depth M,Net Width M,Net Height M,Area Swept Ha,Distance Fished Km,Weight Kg,Count,Bottom Temperature C,Surface Temperature C,Key Date,Key Species,Key Survey,Key Vessel
0,-165.5746,54.42719,96,15.560,7.359,2.474040,1.590,31.828,14.0,4.0,5.6,0,0,0,0
1,-165.5746,54.42719,96,15.560,7.359,2.474040,1.590,280.600,50.0,4.0,5.6,0,1,0,0
2,-165.5746,54.42719,96,15.560,7.359,2.474040,1.590,5.900,7.0,4.0,5.6,0,2,0,0
3,-165.7851,54.22737,80,15.503,7.389,2.646362,1.707,10.400,9.0,4.3,4.7,1,0,0,0
4,-165.7851,54.22737,80,15.503,7.389,2.646362,1.707,50.000,50.0,4.3,4.7,1,1,0,0

## Upload!

In [43]:
engine = sqlalchemy.create_engine('postgresql://username:password@localhost:5432/fishtank')
for table, dataframe in [('dates', date_dimension), ('species', species_dimension), ('surveys', survey_dimension), ('vessels', vessel_dimension), ('trauls', fact_cols)]:
    dataframe.columns = [x.lower().replace(' ', '_') for x in dataframe.columns]
    dataframe.to_sql(table, engine, if_exists='replace', index=False)